import vars
import maze_gen
import time


def print_title():
    title = """
      ▄████████       ▄▄▄▄███▄▄▄▄      ▄████████  ▄███████▄     ▄████████      ▄█  ███▄▄▄▄      ▄██████▄ 
     ███    ███     ▄██▀▀▀███▀▀▀██▄   ███    ███ ██▀     ▄██   ███    ███     ███  ███▀▀▀██▄   ███    ███
     ███    ███     ███   ███   ███   ███    ███       ▄███▀   ███    █▀      ███▌ ███   ███   ███    █▀ 
                     ███    ███ \033[91m▄ ▄\033[0m ███   ███   ███   ███    ███  ▀█▀▄███▀ ▄▄ ▄███▄▄▄     \033[91m▄ ▄\033[0m ███▌ ███   ███  ▄███      
                   ▀███████████ \033[91m▀█▀\033[0m ███   ███   ███ ▀███████████   ▄███▀   ▀ ▀▀███▀▀▀     \033[91m▀█▀\033[0m ███▌ ███   ███ ▀▀███ ████▄
     ███    ███     ███   ███   ███   ███    ███ ▄███▀         ███    █▄      ███  ███   ███   ███    ███
     ███    ███     ███   ███   ███   ███    ███ ███▄     ▄█   ███    ███     ███  ███   ███   ███    ███
     ███    █▀       ▀█   ███   █▀    ███    █▀   ▀████████▀   ██████████     █▀    ▀█   █▀    ████████▀ 
    """

    print("\n"*2)
    for line in title.splitlines():
        print(line.center(vars.COLUMNS))
    print("\n" * 8)

def display_maze(maze: list[list[maze_gen.Cell]]) -> None:                     
    height: int = len(maze)
    width: int = len(maze[0])

    for y in range(height):
        for x in range(width):
            if x == 0:
                print(" " * vars.START_POINT, end="")
            print("\033[90m██", end="")
            if maze[y][x].walls["n"] == 1:
                print("██", end="")
            else:
                print("  ", end="")
        print("██")

        for x in range(width):
            if x == 0:
                print(" " * vars.START_POINT, end="")
            if maze[y][x].walls["w"] == 1:
                if maze[y][x].is_pattern == 1:
                    print("\033[90m██\033[96m██\033[0m", end="")
                else:
                    print("\033[90m██  ", end="")
            else:
                print("    ", end="")
        print("██")

    for x in range(width):
        if x == 0:
            print(" " * vars.START_POINT, end="")
        print("██", end="")
        if maze[height - 1][x].walls["s"] == 1:
            print("██", end="")
        else:
            print("    ", end="")
    print("██")
